In [1]:
import pandas as pd
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Pyspark Day 3").getOrCreate()
from pyspark.sql import functions as F

In [2]:
# Filtering and condition (Where)
# filter the data for depnto = 10 
df = spark.read.csv("emp.csv",header=True)
df_filtered = df.filter(df.deptno == 10)
df_filtered.show()

df.show()

+---+------+------+------+----------+
|eno| ename|salary|deptno|       doj|
+---+------+------+------+----------+
| 10| Amber|  1000|    10|2018-05-14|
|  2|  Amar|  1000|    10|2017-03-22|
|  4|Thomas|  1000|    10|2019-08-18|
|  5|  Jade|  2000|    10|2021-02-10|
|  6| Smith|  1000|    10|2016-12-01|
| 13|Simran|  1500|    10|2019-12-19|
| 16| Rahul|  1200|    10|2016-03-28|
| 18|Rakesh|  1800|    10|2020-09-04|
| 21| Sneha|  2700|    10|2022-12-14|
| 24| Vinod|  1800|    10|2016-07-30|
| 26| Harsh|  1600|    10|2021-09-25|
| 28| Mohan|  1300|    10|2015-04-17|
| 30|Suresh|  1100|    10|2018-09-09|
| 32|  Ajay|  2100|    10|2020-06-26|
| 35| Seema|  3000|    10|2021-10-15|
| 38|  Alok|  2700|    10|2019-03-02|
| 42| Tarun|  2200|    10|2021-01-09|
| 44| Ashok|  1900|    10|2016-06-08|
+---+------+------+------+----------+

+---+------+------+------+----------+
|eno| ename|salary|deptno|       doj|
+---+------+------+------+----------+
| 10| Amber|  1000|    10|2018-05-14|
|  2|  Amar|  1000|    10|2017-03-22|
|  8| Sagar|  1000|    20|2020-11-30|
|  4|Thomas|  1000|    10|2019-08-18|
|  5|  Jade|  2000|    10|2021-02-10|
|  6| Smith|  1000|    10|2016-12-01|
|  7|Robert|  3000|    20|2023-06-25|
|  3|  Nick|  1000|    30|2015-09-15|
|  9| Naman|  4000|    30|2020-01-20|
|  1| Vikas|  1000|    30|2017-10-03|
| 11|Dennis| 41000|    30|2024-01-05|
| 12| Karan|  2200|    20|2018-06-16|
| 13|Simran|  1500|    10|2019-12-19|
| 14|  Amit|  2000|    30|2022-04-09|
| 15|  Neha|  1700|    20|2021-07-22|
| 16| Rahul|  1200|    10|2016-03-28|
| 17| Divya|  3000|    30|2015-11-11|
| 18|Rakesh|  1800|    10|2020-09-04|
| 19|Monica|  2500|    20|2023-08-07|
| 20|  John|  2300|    30|2018-10-29|
+---+------+------+------+----------+
only showing top 20 rows

In [3]:
# Filtering and condition (Where)
# filter the data for depnto = 10 and salary > 1000
df = spark.read.csv("emp.csv",header=True)
df_filtered = df.filter((df.deptno == 10) & (df.salary > 1000))
df_filtered.show()

+---+------+------+------+----------+
|eno| ename|salary|deptno|       doj|
+---+------+------+------+----------+
|  5|  Jade|  2000|    10|2021-02-10|
| 13|Simran|  1500|    10|2019-12-19|
| 16| Rahul|  1200|    10|2016-03-28|
| 18|Rakesh|  1800|    10|2020-09-04|
| 21| Sneha|  2700|    10|2022-12-14|
| 24| Vinod|  1800|    10|2016-07-30|
| 26| Harsh|  1600|    10|2021-09-25|
| 28| Mohan|  1300|    10|2015-04-17|
| 30|Suresh|  1100|    10|2018-09-09|
| 32|  Ajay|  2100|    10|2020-06-26|
| 35| Seema|  3000|    10|2021-10-15|
| 38|  Alok|  2700|    10|2019-03-02|
| 42| Tarun|  2200|    10|2021-01-09|
| 44| Ashok|  1900|    10|2016-06-08|
+---+------+------+------+----------+

In [4]:
# filter the data for depnto = 10 and depnto = 20
df = spark.read.csv("emp.csv",header=True)
df_filtered = df.filter((df.deptno == 10) | (df.deptno == 20))
df_filtered.show()

+---+------+------+------+----------+
|eno| ename|salary|deptno|       doj|
+---+------+------+------+----------+
| 10| Amber|  1000|    10|2018-05-14|
|  2|  Amar|  1000|    10|2017-03-22|
|  8| Sagar|  1000|    20|2020-11-30|
|  4|Thomas|  1000|    10|2019-08-18|
|  5|  Jade|  2000|    10|2021-02-10|
|  6| Smith|  1000|    10|2016-12-01|
|  7|Robert|  3000|    20|2023-06-25|
| 12| Karan|  2200|    20|2018-06-16|
| 13|Simran|  1500|    10|2019-12-19|
| 15|  Neha|  1700|    20|2021-07-22|
| 16| Rahul|  1200|    10|2016-03-28|
| 18|Rakesh|  1800|    10|2020-09-04|
| 19|Monica|  2500|    20|2023-08-07|
| 21| Sneha|  2700|    10|2022-12-14|
| 22| David|  1000|    20|2017-02-17|
| 24| Vinod|  1800|    10|2016-07-30|
| 25| Meena|  2000|    20|2020-03-13|
| 26| Harsh|  1600|    10|2021-09-25|
| 28| Mohan|  1300|    10|2015-04-17|
| 29| Priya|  1200|    20|2023-02-11|
+---+------+------+------+----------+
only showing top 20 rows

In [15]:
# filter the data for depnto = 10 and depnto = 20 using in condition
df = spark.read.csv("emp.csv",header=True)
df_filtered = df.filter((df.deptno.isin(10,20)))
df_filtered.show()

+---+------+------+------+----------+
|eno| ename|salary|deptno|       doj|
+---+------+------+------+----------+
| 10| Amber|  1000|    10|2018-05-14|
|  2|  Amar|  1000|    10|2017-03-22|
|  8| Sagar|  1000|    20|2020-11-30|
|  4|Thomas|  1000|    10|2019-08-18|
|  5|  Jade|  2000|    10|2021-02-10|
|  6| Smith|  1000|    10|2016-12-01|
|  7|Robert|  3000|    20|2023-06-25|
| 12| Karan|  2200|    20|2018-06-16|
| 13|Simran|  1500|    10|2019-12-19|
| 15|  Neha|  1700|    20|2021-07-22|
| 16| Rahul|  1200|    10|2016-03-28|
| 18|Rakesh|  1800|    10|2020-09-04|
| 19|Monica|  2500|    20|2023-08-07|
| 21| Sneha|  2700|    10|2022-12-14|
| 22| David|  1000|    20|2017-02-17|
| 24| Vinod|  1800|    10|2016-07-30|
| 25| Meena|  2000|    20|2020-03-13|
| 26| Harsh|  1600|    10|2021-09-25|
| 28| Mohan|  1300|    10|2015-04-17|
| 29| Priya|  1200|    20|2023-02-11|
+---+------+------+------+----------+
only showing top 20 rows

In [16]:
df.show()

+---+------+------+------+----------+
|eno| ename|salary|deptno|       doj|
+---+------+------+------+----------+
| 10| Amber|  1000|    10|2018-05-14|
|  2|  Amar|  1000|    10|2017-03-22|
|  8| Sagar|  1000|    20|2020-11-30|
|  4|Thomas|  1000|    10|2019-08-18|
|  5|  Jade|  2000|    10|2021-02-10|
|  6| Smith|  1000|    10|2016-12-01|
|  7|Robert|  3000|    20|2023-06-25|
|  3|  Nick|  1000|    30|2015-09-15|
|  9| Naman|  4000|    30|2020-01-20|
|  1| Vikas|  1000|    30|2017-10-03|
| 11|Dennis| 41000|    30|2024-01-05|
| 12| Karan|  2200|    20|2018-06-16|
| 13|Simran|  1500|    10|2019-12-19|
| 14|  Amit|  2000|    30|2022-04-09|
| 15|  Neha|  1700|    20|2021-07-22|
| 16| Rahul|  1200|    10|2016-03-28|
| 17| Divya|  3000|    30|2015-11-11|
| 18|Rakesh|  1800|    10|2020-09-04|
| 19|Monica|  2500|    20|2023-08-07|
| 20|  John|  2300|    30|2018-10-29|
+---+------+------+------+----------+
only showing top 20 rows

In [17]:
# Group by ( Grouping data )
df = spark.read.json("emp_details.json")

In [22]:
# Get the total salary per deptid
df.groupBy('deptid').agg(F.sum("salary").alias("Total_salary")).show()

+------+------------+
|deptid|Total_salary|
+------+------------+
|    50|      156000|
|    10|      272000|
|    30|      237000|
|    20|      227000|
|    60|       66000|
|    40|      195000|
+------+------------+

In [23]:
# Get the total salary based on each deptid and city
df.groupBy('city','deptid').agg(F.sum("salary").alias("Total_salary")).show()

+---------+------+------------+
|     city|deptid|Total_salary|
+---------+------+------------+
|  Chennai|    40|       65000|
|   Mumbai|    20|       60000|
|Bengaluru|    50|       48000|
|     Pune|    20|       49000|
|    Delhi|    20|       62000|
|   Mumbai|    30|       59000|
|Hyderabad|    50|       61000|
|Ahmedabad|    30|       61000|
|Bengaluru|    10|      110000|
|  Kolkata|    10|      107000|
|  Chennai|    60|       66000|
|   Jaipur|    50|       47000|
|     Pune|    30|       57000|
|    Delhi|    40|      130000|
|Hyderabad|    30|       60000|
|    Surat|    20|       56000|
|   Mumbai|    10|       55000|
+---------+------+------------+

In [33]:
# Get the min,max.avg,total salary from each city
df_ans = df.groupBy('city').agg(F.min("salary").alias("min_salary"),F.max("salary").alias("max"),F.avg("salary").alias("avg_salary")
                      ,F.sum("salary").alias("total_salary"),F.count("salary").alias("total_employees"))
df_ans.show()

+---------+----------+-----+------------------+------------+---------------+
|     city|min_salary|  max|        avg_salary|total_salary|total_employees|
+---------+----------+-----+------------------+------------+---------------+
|  Chennai|     65000|66000|           65500.0|      131000|              2|
|   Mumbai|     55000|60000|           58000.0|      174000|              3|
|Ahmedabad|     61000|61000|           61000.0|       61000|              1|
|  Kolkata|     53000|54000|           53500.0|      107000|              2|
|    Surat|     56000|56000|           56000.0|       56000|              1|
|     Pune|     49000|57000|           53000.0|      106000|              2|
|    Delhi|     62000|67000|           64000.0|      192000|              3|
|Bengaluru|     48000|58000|52666.666666666664|      158000|              3|
|Hyderabad|     60000|61000|           60500.0|      121000|              2|
|   Jaipur|     47000|47000|           47000.0|       47000|              1|
+---------+----------+-----+------------------+------------+---------------+

In [59]:
# Filter before gouping and order in ascending order of deptid

df_filter = df.filter(df.salary <55000)
#df_filter.show()
df_grouped = df_filter.groupby('deptid').agg(F.count('eno').alias('total_count'))
df_grouped.orderBy(df_grouped.deptid.asc()).show()

+------+-----------+
|deptid|total_count|
+------+-----------+
|    10|          3|
|    20|          1|
|    50|          2|
+------+-----------+

In [53]:
# filtering the grouped data ( HAVING)
# get me all the deptid where total_salary in the department is more than 250000

# Way 1
df_grouped = df.groupby('deptid').agg(F.sum('salary').alias('total_sal'))
df_ans = df_grouped.filter(df_grouped.total_sal > 250000)
df_ans.show()

+------+---------+
|deptid|total_sal|
+------+---------+
|    10|   272000|
+------+---------+

In [52]:
# Way 2 
df_ans = df.groupby('deptid').agg(F.sum('salary').alias('total_sal')).filter('total_sal > 250000').show()

+------+---------+
|deptid|total_sal|
+------+---------+
|    10|   272000|
+------+---------+

# Joins

In [78]:
df_emp = spark.read.json("emp_details.json")
df_dept = spark.read.json("dept.json")
df_department = spark.read.json("department.json")

df_emp.show()
df_dept.show()
df_department.show()

+---------+------+---+------+
|     city|deptid|eno|salary|
+---------+------+---+------+
|   Mumbai|    10|101| 55000|
|    Delhi|    20|102| 62000|
|Bengaluru|    10|103| 58000|
|Hyderabad|    30|104| 60000|
|     Pune|    20|105| 49000|
|  Kolkata|    10|106| 53000|
|  Chennai|    40|107| 65000|
|Ahmedabad|    30|108| 61000|
|   Jaipur|    50|109| 47000|
|    Surat|    20|110| 56000|
|   Mumbai|    30|111| 59000|
|    Delhi|    40|112| 63000|
|Bengaluru|    10|113| 52000|
|Hyderabad|    50|114| 61000|
|  Chennai|    60|115| 66000|
|     Pune|    30|116| 57000|
|  Kolkata|    10|117| 54000|
|   Mumbai|    20|118| 60000|
|    Delhi|    40|119| 67000|
|Bengaluru|    50|120| 48000|
+---------+------+---+------+

+------+--------+
|deptid|deptname|
+------+--------+
|    10| Finance|
|    20|      HR|
|    30|      IT|
|   100|  Travel|
+------+--------+

+----------+------+
|  deptname|deptno|
+----------+------+
|   Finance|    10|
|        HR|    20|
|        IT|    30|
|Operations|    40|
| Marketing|    50|
|     Legal|    70|
|     Admin|    80|
+----------+------+

# Joins with the same columns name in both dataframes

In [63]:
# Inner join
df_emp.join(df_dept,on='deptid',how='inner').show()

+------+---------+---+------+--------+
|deptid|     city|eno|salary|deptname|
+------+---------+---+------+--------+
|    10|   Mumbai|101| 55000| Finance|
|    20|    Delhi|102| 62000|      HR|
|    10|Bengaluru|103| 58000| Finance|
|    30|Hyderabad|104| 60000|      IT|
|    20|     Pune|105| 49000|      HR|
|    10|  Kolkata|106| 53000| Finance|
|    30|Ahmedabad|108| 61000|      IT|
|    20|    Surat|110| 56000|      HR|
|    30|   Mumbai|111| 59000|      IT|
|    10|Bengaluru|113| 52000| Finance|
|    30|     Pune|116| 57000|      IT|
|    10|  Kolkata|117| 54000| Finance|
|    20|   Mumbai|118| 60000|      HR|
+------+---------+---+------+--------+

In [68]:
# left join
df_ans = df_emp.join(df_dept,on='deptid',how='left')
df_ans.orderBy(df_ans.deptname.desc()).show()

+------+---------+---+------+--------+
|deptid|     city|eno|salary|deptname|
+------+---------+---+------+--------+
|    30|Hyderabad|104| 60000|      IT|
|    30|Ahmedabad|108| 61000|      IT|
|    30|   Mumbai|111| 59000|      IT|
|    30|     Pune|116| 57000|      IT|
|    20|    Delhi|102| 62000|      HR|
|    20|     Pune|105| 49000|      HR|
|    20|    Surat|110| 56000|      HR|
|    20|   Mumbai|118| 60000|      HR|
|    10|   Mumbai|101| 55000| Finance|
|    10|Bengaluru|103| 58000| Finance|
|    10|  Kolkata|106| 53000| Finance|
|    10|Bengaluru|113| 52000| Finance|
|    10|  Kolkata|117| 54000| Finance|
|    40|  Chennai|107| 65000|    NULL|
|    50|   Jaipur|109| 47000|    NULL|
|    40|    Delhi|112| 63000|    NULL|
|    50|Hyderabad|114| 61000|    NULL|
|    60|  Chennai|115| 66000|    NULL|
|    40|    Delhi|119| 67000|    NULL|
|    50|Bengaluru|120| 48000|    NULL|
+------+---------+---+------+--------+

In [70]:
# Right join
df_ans = df_emp.join(df_dept,on='deptid',how='right')
df_ans.orderBy(df_ans.deptname.desc()).show()

+------+---------+----+------+--------+
|deptid|     city| eno|salary|deptname|
+------+---------+----+------+--------+
|   100|     NULL|NULL|  NULL|  Travel|
|    30|     Pune| 116| 57000|      IT|
|    30|   Mumbai| 111| 59000|      IT|
|    30|Ahmedabad| 108| 61000|      IT|
|    30|Hyderabad| 104| 60000|      IT|
|    20|   Mumbai| 118| 60000|      HR|
|    20|    Surat| 110| 56000|      HR|
|    20|     Pune| 105| 49000|      HR|
|    20|    Delhi| 102| 62000|      HR|
|    10|  Kolkata| 117| 54000| Finance|
|    10|Bengaluru| 113| 52000| Finance|
|    10|  Kolkata| 106| 53000| Finance|
|    10|Bengaluru| 103| 58000| Finance|
|    10|   Mumbai| 101| 55000| Finance|
+------+---------+----+------+--------+

In [71]:
# Full/outer join
df_ans = df_emp.join(df_dept,on='deptid',how='full')
df_ans.orderBy(df_ans.deptname.desc()).show()

+------+---------+----+------+--------+
|deptid|     city| eno|salary|deptname|
+------+---------+----+------+--------+
|   100|     NULL|NULL|  NULL|  Travel|
|    30|Hyderabad| 104| 60000|      IT|
|    30|Ahmedabad| 108| 61000|      IT|
|    30|   Mumbai| 111| 59000|      IT|
|    30|     Pune| 116| 57000|      IT|
|    20|    Delhi| 102| 62000|      HR|
|    20|     Pune| 105| 49000|      HR|
|    20|    Surat| 110| 56000|      HR|
|    20|   Mumbai| 118| 60000|      HR|
|    10|   Mumbai| 101| 55000| Finance|
|    10|Bengaluru| 103| 58000| Finance|
|    10|  Kolkata| 106| 53000| Finance|
|    10|Bengaluru| 113| 52000| Finance|
|    10|  Kolkata| 117| 54000| Finance|
|    40|  Chennai| 107| 65000|    NULL|
|    40|    Delhi| 112| 63000|    NULL|
|    40|    Delhi| 119| 67000|    NULL|
|    50|   Jaipur| 109| 47000|    NULL|
|    50|Hyderabad| 114| 61000|    NULL|
|    50|Bengaluru| 120| 48000|    NULL|
+------+---------+----+------+--------+
only showing top 20 rows

In [73]:
# Left semi join
df_emp.join(df_dept,on='deptid',how='left_semi').show()

+------+---------+---+------+
|deptid|     city|eno|salary|
+------+---------+---+------+
|    10|   Mumbai|101| 55000|
|    20|    Delhi|102| 62000|
|    10|Bengaluru|103| 58000|
|    30|Hyderabad|104| 60000|
|    20|     Pune|105| 49000|
|    10|  Kolkata|106| 53000|
|    30|Ahmedabad|108| 61000|
|    20|    Surat|110| 56000|
|    30|   Mumbai|111| 59000|
|    10|Bengaluru|113| 52000|
|    30|     Pune|116| 57000|
|    10|  Kolkata|117| 54000|
|    20|   Mumbai|118| 60000|
+------+---------+---+------+

In [75]:
# Left anti join
df_emp.join(df_dept,on='deptid',how='left_anti').show()

+------+---------+---+------+
|deptid|     city|eno|salary|
+------+---------+---+------+
|    40|  Chennai|107| 65000|
|    50|   Jaipur|109| 47000|
|    40|    Delhi|112| 63000|
|    50|Hyderabad|114| 61000|
|    60|  Chennai|115| 66000|
|    40|    Delhi|119| 67000|
|    50|Bengaluru|120| 48000|
+------+---------+---+------+

# Joins when both data framews having different common column name

In [81]:
# Inner join
df_emp.join(df_department,on=df_emp.deptid == df_department.deptno,how='inner').show()
# or

df_emp.join(df_department,df_emp.deptid == df_department.deptno,'inner').show()

+---------+------+---+------+----------+------+
|     city|deptid|eno|salary|  deptname|deptno|
+---------+------+---+------+----------+------+
|   Mumbai|    10|101| 55000|   Finance|    10|
|    Delhi|    20|102| 62000|        HR|    20|
|Bengaluru|    10|103| 58000|   Finance|    10|
|Hyderabad|    30|104| 60000|        IT|    30|
|     Pune|    20|105| 49000|        HR|    20|
|  Kolkata|    10|106| 53000|   Finance|    10|
|  Chennai|    40|107| 65000|Operations|    40|
|Ahmedabad|    30|108| 61000|        IT|    30|
|   Jaipur|    50|109| 47000| Marketing|    50|
|    Surat|    20|110| 56000|        HR|    20|
|   Mumbai|    30|111| 59000|        IT|    30|
|    Delhi|    40|112| 63000|Operations|    40|
|Bengaluru|    10|113| 52000|   Finance|    10|
|Hyderabad|    50|114| 61000| Marketing|    50|
|     Pune|    30|116| 57000|        IT|    30|
|  Kolkata|    10|117| 54000|   Finance|    10|
|   Mumbai|    20|118| 60000|        HR|    20|
|    Delhi|    40|119| 67000|Operations|    40|
|Bengaluru|    50|120| 48000| Marketing|    50|
+---------+------+---+------+----------+------+

+---------+------+---+------+----------+------+
|     city|deptid|eno|salary|  deptname|deptno|
+---------+------+---+------+----------+------+
|   Mumbai|    10|101| 55000|   Finance|    10|
|    Delhi|    20|102| 62000|        HR|    20|
|Bengaluru|    10|103| 58000|   Finance|    10|
|Hyderabad|    30|104| 60000|        IT|    30|
|     Pune|    20|105| 49000|        HR|    20|
|  Kolkata|    10|106| 53000|   Finance|    10|
|  Chennai|    40|107| 65000|Operations|    40|
|Ahmedabad|    30|108| 61000|        IT|    30|
|   Jaipur|    50|109| 47000| Marketing|    50|
|    Surat|    20|110| 56000|        HR|    20|
|   Mumbai|    30|111| 59000|        IT|    30|
|    Delhi|    40|112| 63000|Operations|    40|
|Bengaluru|    10|113| 52000|   Finance|    10|
|Hyderabad|    50|114| 61000| Marketing|    50|
|     Pune|    30|116| 57000|        IT|    30|
|  Kolkata|    10|117| 54000|   Finance|    10|
|   Mumbai|    20|118| 60000|        HR|    20|
|    Delhi|    40|119| 67000|Operations|    40|
|Bengaluru|    50|120| 48000| Marketing|    50|
+---------+------+---+------+----------+------+

# complete for all other joins